In [12]:
import  pandas as pd
import numpy as np

In [4]:
data = [["Piyush", 99], ["Jack", 67], ["Rohit", 35]]

In [5]:
pd.DataFrame(data, columns = ["Name", "Makrs"])

     Name  Makrs
0  Piyush     99
1    Jack     67
2   Rohit     35

In [8]:
data = {"a": [4,5,3],"b": [7,8,9]}

In [9]:
df = pd.DataFrame(data)

In [11]:
df

   a  b
0  4  7
1  5  8
2  3  9

In [13]:
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])

In [14]:
df = pd.DataFrame(arr, columns = ["A","B","C"])

In [15]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df = pd.read_excel("data.xlsx")

In [20]:
!pip install openpyxl

Requirement already satisfied: openpyxl in e:\jupyterproject\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in e:\jupyterproject\.venv\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [21]:
df

,Student Name,Present Day Percentage(Sept),Present Day Percentage(Oct),Present Day Percentage(Nov),Oveall Percentage
0,Shaik Nizamuddin,100.00,91.67,100.0,97.223333
1,Piyush Raj,42.86,100.00,100.0,80.953333
2,Guvvala nanni Vardhan Reddy,92.86,100.00,100.0,97.620000
3,Adesh Dahat,64.29,75.00,100.0,79.763333
4,Lucky Patel,92.86,66.67,100.0,86.510000
...,...,...,...,...,...
57,Pratiksha Patil,57.14,75.00,100.0,77.380000
58,Tejal Prashant Zakade,28.57,83.33,50.0,53.966667
59,Suradkar sumedh Rajendra,28.57,83.33,0.0,37.300000
60,Bhalerao mansi Sachin,7.14,0.00,0.0,2.380000
61,Viresh Amar Singh,7.14,0.00,NaN,2.380000

In [22]:
df = pd.read_csv("data.csv")

In [23]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [25]:
df = pd.read_json("data.json")

In [26]:
df

     name    lang
0  Piyush  Python
1  Deepak       C

In [27]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [28]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [29]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [30]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [33]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [35]:
df.shape

(244, 7)

In [37]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')